benchmarks/sglang/runpod_a100sxm/gpt-oss-120b/A100_tp4_dp2_in8192_out128_p100_c100_46cf8d.txt
BENCHMARK: tp4_dp2_in8192_out128_p100_c100_46cf8d
================================================================
Command: python -m sglang.bench_serving --port 30000 --model /workspace/gpt-oss-120b --host 127.0.0.1 --backend sglang --dataset-name random --random-input-len 8192 --random-output-len 128 --num-prompts 100 --max-concurrency 100 --request-rate inf --output-file ./benchmark_results_tp4_dp2_A100/tp4_dp2_in8192_out128_p100_c100_46cf8d.jsonl --output-details
================================================================

benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/workspace/gpt-oss-120b', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file='./benchmark_results_tp4_dp2_A100/tp4_dp2_in8192_out128_p100_c100_46cf8d.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/workspace/gpt-oss-120b', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file='./benchmark_results_tp4_dp2_A100/tp4_dp2_in8192_out128_p100_c100_46cf8d.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 389505
#Output tokens: 6108
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:01<03:04,  1.86s/it]
  2%|▏         | 2/100 [00:05<04:42,  2.88s/it]
  5%|▌         | 5/100 [00:05<01:20,  1.18it/s]
  8%|▊         | 8/100 [00:05<00:40,  2.28it/s]
 11%|█         | 11/100 [00:05<00:24,  3.61it/s]
 20%|██        | 20/100 [00:05<00:08,  9.29it/s]
 24%|██▍       | 24/100 [00:06<00:06, 11.04it/s]
 28%|██▊       | 28/100 [00:06<00:05, 12.72it/s]
 32%|███▏      | 32/100 [00:06<00:04, 15.72it/s]
 38%|███▊      | 38/100 [00:06<00:03, 20.64it/s]
 42%|████▏     | 42/100 [00:06<00:02, 19.44it/s]
 46%|████▌     | 46/100 [00:06<00:02, 22.51it/s]
 54%|█████▍    | 54/100 [00:07<00:01, 32.05it/s]
 62%|██████▏   | 62/100 [00:07<00:00, 40.31it/s]
 68%|██████▊   | 68/100 [00:07<00:00, 37.83it/s]
 74%|███████▍  | 74/100 [00:07<00:00, 41.51it/s]
 79%|███████▉  | 79/100 [00:07<00:00, 40.43it/s]
 87%|████████▋ | 87/100 [00:07<00:00, 47.77it/s]
 94%|█████████▍| 94/100 [00:07<00:00, 46.52it/s]
 99%|█████████▉| 99/100 [00:08<00:00, 35.64it/s]
100%|██████████| 100/100 [00:08<00:00, 12.25it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 100       
Successful requests:                     100       
Benchmark duration (s):                  8.18      
Total input tokens:                      389505    
Total input text tokens:                 389505    
Total generated tokens:                  6108      
Total generated tokens (retokenized):    6104      
Request throughput (req/s):              12.23     
Input token throughput (tok/s):          47637.45  
Output token throughput (tok/s):         747.02    
Peak output token throughput (tok/s):    3062.00   
Peak concurrent requests:                100       
Total token throughput (tok/s):          48384.48  
Concurrency:                             83.63     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   6838.13   
Median E2E Latency (ms):                 7025.79   
P90 E2E Latency (ms):                    7746.26   
P99 E2E Latency (ms):                    8122.83   
---------------Time to First Token----------------
Mean TTFT (ms):                          2826.76   
Median TTFT (ms):                        2677.74   
P99 TTFT (ms):                           5774.52   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          146.99    
Median TPOT (ms):                        67.53     
P99 TPOT (ms):                           1322.20   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           66.77     
Median ITL (ms):                         22.19     
P95 ITL (ms):                            25.51     
P99 ITL (ms):                            2406.50   
Max ITL (ms):                            5157.23   
==================================================